haliwt/Drv8302_mkv46f256vlh16_servo/main.c
		if( xResult == pdPASS )
		{
			
             ucConKeyValue = vlSubj;
             printf("vTaskSUBJ vlSubj = %#x\r\n", ucConKeyValue);
             /*******************ABC_POWER_F*************************/
             #if 1
             if(ucConKeyValue==0x01)
			 {
                 
                  //abc_s ++ ;
                 if(abc_s == 0)
                 {
                   A_POWER_OUTPUT =0;
                   abc_s ++ ;
                  //printf("ABC_= 1 @@@@~~~@@@\r\n");
                  UART_WriteBlocking(DEMO_UART,vTasktx1,sizeof(vTasktx1)-1);
		     
			     }
			     else 
                 {
                   abc_s = 0;
                   A_POWER_OUTPUT =1;
                  
                  //printf("ABC_ = 0 @@@@@@@~~~\r\n"); 
                   UART_WriteBlocking(DEMO_UART,vTasktx2,sizeof(vTasktx2)-1);
                 }
		     }
             #endif 
			 /*******************Door_F*************************/
			 if(ucConKeyValue==0x08)
			 {
               
                door_s ++ ;
                if(door_s ==1)
                {
                  DOOR_OUTPUT =1;//door open
                  printf("DOOR_OUTPUT = 1 @@@@@@@\r\n");  
		        }
                else
                {
                  door_s =0;
                  DOOR_OUTPUT =0;//door open
                  printf("DOOR_OUTPUT = 0 ~~~~~~~\r\n");  
                }
		     }
			 /*******************WIPERS_F***************************/
             if(ucConKeyValue == 0x09)
	         {
	  			
	  			 wipers_s ++ ;
                 if(wipers_s == 1)
                 {
                   WIPER_OUTPUT_1 = 1;
                   printf("WIPERS  = 1 @@@@~~~~\r\n");   
                 }
			     else if(wipers_s == 2)
                 {
                   wipers_s = 0;
                   WIPER_OUTPUT_1 = 2;   
                   printf("WIPERS  = 2 ~~~~@@@@\r\n");
                 }
			 
			    else if(wipers_s == 3)
                 {
                     WIPER_OUTPUT_1 = 3;   
                
                    printf("WIPERS  = 3 @@@~~~~@@@\r\n");
                  }
                else
                 {
                     wipers_s =0;
                      WIPER_OUTPUT_1 = 0;   
                    
                      printf("WIPERS  = 0 @@@~~~~@@@~~~~\r\n");
                 }
             }
		     /*******************AIR_F***************************/   
              if(ucConKeyValue == 0x12)
			 {
                 AIR_OUTPUT = 1;
                
				printf("AIR  = 1 ~~@@@~~\r\n");
			 }
              if(ucConKeyValue == 0x13)
			 {
                 AIR_OUTPUT = 0;
                
				printf("AIR  = 0 ~~@@@~~@@@~~~~@@@\r\n");
			 }
        }
		else
		{
			/* 3?ê± */
			LED1=!LED1;
			
		}

    vTaskDelayUntil(&xLastWakeTime, xFrequency); // vTaskDelay(xMaxBlockTime); 
	}
}
/*********************************************************************************************************
*	函 数 名: vTaskBLDC
*	功能说明: 使用函数xQueueReceive接收任务vTaskTaskUserIF发送的消息队列数据(xQueue2)	
*	形    参: pvParameters 是在创建该任务时传递的形参
*	返 回 值: 无
*   优 先 级: 3  
*********************************************************************************************************/
static void vTaskBLDC(void *pvParameters)
{
    uint8_t txbuff[]="vTaskBLDC 3\r\n";
    uint32_t ucValue;
   
//	TickType_t xLastWakeTime;
	
//	const TickType_t xFrequency = 100;
 //  xLastWakeTime = xTaskGetTickCount();
    volatile uint16_t pwm_f=0;
	uint16_t sampleMask;
	BaseType_t xResult;
   
    const TickType_t xMaxBlockTime = pdMS_TO_TICKS(5); /* 设置最大等待时间为300ms */
	uint32_t ucConValue;
    uint16_t dirvalue;
	uint8_t vTasktx1[]="BLDC receive success!!";
   
    uint8_t vBLDCtx2[] = "Motor Run is OK !!!!";
    uint8_t printx1[]="Dir = Dir is OK !!!! CW \r\n";
    uint8_t printx2[]="Dir = - Dir is OK #### CCW \r\n";
	while(1)
    {       
        
        //printf("vTaskBLDC-2 \r\n");  
        UART_WriteBlocking(DEMO_UART,txbuff,sizeof(txbuff)-1);
        xResult = xTaskNotifyWait(0x00000000,      
						          0xFFFFFFFF,      
						          &ucConValue,        /* 存储ulNotifiedValue在ulvalue中 */
						          xMaxBlockTime);  /* 最大延迟时间 */
	  if(xResult == pdPASS)
		{
			/* 接收数据成功 */
          //printf("vTaskBLDC ConmessageID = %#x\r\n",ucConValue );
           UART_WriteBlocking(DEMO_UART,vTasktx1,sizeof(vTasktx1)-1);
		  ucValue = ucConValue ;
		}
		else
		{
			/* 超时 */
          LED2= !LED2;
		}
     #if 0 
      if(ucValue == 0x01)
      {
         A_POWER_OUTPUT =1;
		
		 
        // printf("ABC_= 1 @@@@~~~@@@\r\n");
         UART_WriteBlocking(DEMO_UART,vTasktx2,sizeof(vTasktx2)-1);
		 
	  }
	  else if(ucValue == 0x02)
	  {

         A_POWER_OUTPUT =0;
		
		
		//printf("ABC_= 0 ~~~~~~~~~\r\n"); 
         UART_WriteBlocking(DEMO_UART,vTasktx3,sizeof(vTasktx3)-1);
	  }
	  #endif 

		
	  if((ucValue==0xa1)|| (recoder_number.break_f ==1))//刹车
	  {
       
        
           
         taskENTER_CRITICAL(); //进入临界状态
		 PMW_AllClose_ABC_Channel();
         PMW_AllClose_ABC_Channel();
		
		 if(recoder_number.break_f ==1)
		 {
		     A_POWER_OUTPUT =0;
			  
		  }
		 taskEXIT_CRITICAL(); //退出临界状态
		 
		 //printf("Break is OK $$$$$$$$$$$$$\r\n");
        
	  }
	  else if(ucValue==0xa0)  
	  { 
            
            /* 接收数据成功 */
             printf("Motor run = %#x\r\n",ucConValue);
			// printf("Motor Run is OK !!!!\r\n");
             UART_WriteBlocking(DEMO_UART,vBLDCtx2,sizeof(vBLDCtx2)-1);

	       /**********************adjust frequency ****************************/
			{
            
		    CADC_DoSoftwareTriggerConverter(CADC_BASEADDR, kCADC_ConverterA);
	             /* Wait the conversion to be done. */
	         while (kCADC_ConverterAEndOfScanFlag !=
	               (kCADC_ConverterAEndOfScanFlag & CADC_GetStatusFlags(CADC_BASEADDR)))
	        {
	        }

	        /* Read the result value. */
	        if (sampleMask == (sampleMask & CADC_GetSampleReadyStatusFlags(CADC_BASEADDR)))
	        {
              //  pwm_f =(int16_t)CADC_GetSampleResultValue(CADC_BASEADDR, 1U);
		      //   PRINTF("%d\t\t",pwm_f );
	           
